    .data
one:    1      ; заповнення мітки one числом 1
var1:   0     ; заповнення мітки var1 числом 0
limit:  10   ; заповнення мітки limit числом 10
    .code
        lw r1 one     ; запис у регістр#1 числа з міткою one (значення 1)
        lw r2 var1    ; запис у регістр#2 числа з міткою var1 (початкове значення 0)
        lw r3 limit   ; запис у регістр#3 числа з міткою limit (значення 10)
loop: 	inc r2       ; збільшення значення регістра#2 на 1
        jmbe r2 r3 loop   ; перехід на мітку loop, якщо значення у регістрі#2 менше або дорівнює значенню у регістрі#3
        bt r2 r1          
loop2: 	sbb r2 r1 r2  ; віднімання значення регістра#1 з регістра#2 з урахуванням позичання, результат записується у регістр#2
        jmae r1 r2 loop2  ; перехід на мітку loop2, якщо значення у регістрі#1 більше або дорівнює значенню у регістрі#2
        rcl r2 r3 r2       ; циклічний зсув вліво значення у регістрі#2 на кількість позицій у регістрі#3, результат записується у регістр#2
done: 	halt        ; завершення виконання програми